{
  "main": {
    "name": "Wijdan Kuddah",
    "occupation": "Full Stack Web Developer who is motivated by new challenges!",
    "description": "My MIS degree helped me to always think about the business needs first. And in today’s world of rapid digital transformation, I come in to help businesses increase their outreach by providing them with simple and easy to use web applications.",
    "bio": "My name is Wijdan, I'm a Full Stack Web Developer. Currently I'm working as Freelancer",
    "contactmessage": "Get in touch with me to receive further details, get coached or anything else.",
    "email": "wijdan.w.k@outlook.sa",
    "address": {
      "city": "Jeddah",
      "state": "SA"
    },
    "website": "https://wijdan.me/Portfolio-2019/",
    "resumedownload": "https://www.linkedin.com/in/wijdan-kuddah/",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/wijdan-kuddah/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/wijdan1995",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "King AbdulAziz University",
        "degree": "Bachelor of Science, Field Of Study Management Information Systems",
        "graduated": "December 2017",
        "description": "Graduated with Distinction"
      }
    ],
    "work": [
      {
        "company": "xAmber",
        "title": "Web Developer",
        "years": "Sep 2019 - Apr 2020",
        "description": "Worked with ReactJS, NextJS and NodeJS web applications."
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "NextJs",
        "level": "90%"
      },
      {
        "name": "nodeJs",
        "level": "80%"
      },
      {
        "name": "Git and Github",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "100%"
      },
      {
        "name": "CSS",
        "level": "95%"
      },
      {
        "name": "BootStrap ",
        "level": "95%"
      },
      {
        "name": "JavaScript",
        "level": "90%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Learn Coding App",
        "category": "Full-stack application using React.js for the front-end and Express.js and MongoDB for the back-end, With responsive design. In this app, you can watch all the videos and filter it by category as a visitor, if you sign up you will be able to add comments and add the videos to your list.",
        "image": "project1.gif",
        "url": "https://wijdan1995.github.io/project-4-frontend/#/"
      },
      {
        "title": "Currency Converter App",
        "category": "This application allows you to convert currencies and show you the live currency rates at that moment. We built this application using React.js and APIs for the back-end in one week as a team with my teammates Amany, Taha, and Maha.",
        "image": "project2.gif",
        "url": "https://wdi-techteam.github.io/project-3/#/"
      },
      {
        "title": "Projects Tracker App",
        "category": "Full-stack application using Ruby on Rails, With responsive design. It allows you to add projects and tasks and mark as completed to the tasks you completed.",
        "image": "project3.gif",
        "url": "https://calm-plains-99226.herokuapp.com/"
      },
      {
        "title": "Tic Tac Toe Game",
        "category": "This tic tac toe game built using HTML, CSS, and JavaScript , With responsive design. Where you can play with AI or friend while keeping your scores.",
        "image": "project4.gif",
        "url": "https://wijdan1995.github.io/tic-tac-toe/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "As the Lead Software Engineering Instructor for GA/Misk, I had the privilege of working with Wijdan for 3 months during the Software Engineering Immersive program.  Wijdan is a talented developer and quick learner.  She is a strong teammate and would often teach other students in the classroom if they were confused about a technical topic.  Wijdan's projects went above and beyond our project requirements by researching and implementing technologies that we did not teach.  Wijdan's problem solving and programming skills along with her communication and leadership skills make Wijdan a stellar technical team member.  I give her my highest recommendation and can not wait to see what she does next!",
        "user": "Michael Finneran | Software Engineer, Consultant, Educator"
      }
    ]
  }
}